Mobile Client/DataProcessors/СозданиеЗаписиКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СозданиеЗаписиКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Mobile Client/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Mobile Client/DataProcessors/СозданиеЗаписиКлиента/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаписатьсяНаСервере()
	ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
    ЗаписьКлиента.Дата = НачалоМинуты(Объект.ДатаЗаписи);
    ЗаписьКлиента.Сотрудник = Объект.Сотрудник;
    
    СтрокаУслуги = ЗаписьКлиента.Услуги.Добавить();
    СтрокаУслуги.Услуга = Объект.Услуга;
    СтрокаУслуги.Стоимость = Объект.Стоимость;

	СтруктураРеквизитовДокумента = Новый Структура;
    СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
    СтруктураРеквизитовДокумента.Вставить("Сотрудник", Строка(Объект.Сотрудник));
    СтруктураРеквизитовДокумента.Вставить("GUIDПользователя", ПараметрыСеанса.ТекущийПользователь.ВнешнийGUID);
    
    МассивУслуг = Новый Массив;
  
    Услуга = Новый Структура;
    Услуга.Вставить("Номенклатура", Строка(Объект.Услуга));
    Услуга.Вставить("Цена", Объект.Стоимость);
    Услуга.Вставить("Количество", 1);
    Услуга.Вставить("Сумма", Объект.Стоимость);
        
    МассивУслуг.Добавить(Услуга);
    СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);
	
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента); 
	
    ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
    Если ДокументУспешноОтправлен Тогда        
        ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение);
        
        СообщениеПользователю = Новый СообщениеПользователю;
        СообщениеПользователю.Текст = СтрШаблон("Вы записаны на услугу %1 к мастеру %2 на дату %3", 
       			Объект.Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));                                    
        СообщениеПользователю.Сообщить();

        Объект.ДатаЗаписи = '00010101';
        Объект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
        Объект.Услуга = Справочники.Услуги.ПустаяСсылка();
        Объект.Стоимость = 0;    
    Иначе    
        СообщениеПользователю = Новый СообщениеПользователю;
        СообщениеПользователю.Текст = "Не удалось отправить Запись!";
        СообщениеПользователю.Сообщить();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Записаться(Команда)
	ЗаписатьсяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Объект.Стоимость = УстановитьСтоимость(Объект.Услуга);
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьСтоимость(Ссылка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Услуги.Стоимость КАК Стоимость
	               |ИЗ
	               |	Справочник.Услуги КАК Услуги
	               |ГДЕ
	               |	Услуги.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Стоимость;	
КонецФункции
